#아래 코드를 실행하면 자료형이 무엇으로 나오는지 말해보시오.

#[1]: 자료형 맞추기
a = (1, 2, 3, 4, 5)
print('[1-1]a 변수값의 자료형: ', a, type(a))

b = 1, 2, 3, 4, 5, 6, 7, 8, 9
print('[1-2]b 변수값의 자료형: ', b, type(b))

#아스키 코드란 무엇인지 설명하시오.

#[1]: 아스키 코드란?
#컴퓨터 내부에서 숫자 똔느 문자에 대한 정보처리를 이진수로 처리한다. 0과 1 두개로만 처리 --> 즉, 문자도 숫자로 기억한다.
#이 때, 문자와 숫자를 대응시켜줘야 하는데 여러 방법 중 아스키 코드 방식을 사용한다.
#영어 알파벳(Alphabet) 각각의 문자에 번호를 붙여서 처리 --> 번호를 붙일 때 ASCII(아스키) 규약에 따라 붙임 --> 아스키 코드

#[2]: 몇개는 외우는게 좋다.
#대문자 A --> 65(이후부터는 하나씩 증가하므로 B --> 66)
#소문자 a --> 97(하나씩 증가하므로 100은 소문자 d)
#숫자 0 --> 48(하나씩 증가하므로 57은 숫자 9)
#엔터(Enter) --> 13
#아스키코드 0번 --> NULL

